import { Component, OnInit } from '@angular/core';
import { ActivatedRoute } from '@angular/router';
import { ApiService } from 'api.service';
declare var $;

@Component({
  selector: 'app-blogs-details',
  templateUrl: './blogs-details.component.html',
  styleUrls: ['./blogs-details.component.css']
})
export class BlogsDetailsComponent implements OnInit {

  constructor(private route: ActivatedRoute,private apiService: ApiService,) {  }
  blogId: string = '';
  
  ngOnInit(): void {
    window.scrollTo(0, 0);

    this.blogId = this.route.snapshot.paramMap.get('id') || '';
 
  this.fetchNews()

 
  }
    fetchNews() {
       $('#preloader').fadeIn();
    this.apiService.getData('get-news.php').subscribe({
      next: data => {
        this.blogs = data
    for (let i = 0; i <= this.blogs.length; ++i) {

      if (this.blogId == this.blogs[i]['id']) {
        this.blog = this.blogs[i];
        break;
      }
    }
        
        $('#preloader').fadeOut();
      },
      error: err => {
        console.error('Error loading news', err)
       $('#preloader').fadeOut();
    }
    });
    }
  
  blog:any={}
  blogs: any = [
  //   {
  //   'id':'1',
  //   'title': 'Your First Solution: The Key to Effective Marketing & Media Production',
  //   'author': 'YFS Team',
  //   'date': 'April 15, 2025',
  //   'image': '../../assets/news/featured.jfif',
  //   'content': `
  //       <h2>العلامة التجارية “YFS” - الحل الأمثل للإنتاج الإعلامي والتسويق الفعّال</h2>
  //       <p>في عالمٍ مليء بالتحديات التسويقية والتطورات الرقمية المتسارعة...</p>

  //       <h3>من نحن؟</h3>
  //       <p>“YFS” هي وكالة تسويق وإنتاج إعلامي تسعى إلى تقديم حلول متكاملة...</p>

  //       <h3>خدماتنا المتنوعة</h3>
  //       <ul>
  //         <li><strong>التسويق الرقمي:</strong> إدارة حملات الوسائط الاجتماعية والإعلانات.</li>
  //         <li><strong>الإنتاج الإعلامي:</strong> فيديوهات إعلانية، موشن جرافيك، تصوير احترافي.</li>
  //         <li><strong>الإبداع والعلامة التجارية:</strong> بناء هوية بصرية قوية.</li>
  //         <li><strong>كتابة النصوص الإبداعية:</strong> نصوص إعلانات وفيديوهات.</li>
  //         <li><strong>التسويق عبر المؤثرين:</strong> الوصول إلى جمهور واسع عبر مؤثرين.</li>
  //       </ul>

  //       <h3>لماذا تختار YFS؟</h3>
  //       <ul>
  //         <li>الابتكار: حلول جديدة تواكب التوجهات الحديثة.</li>
  //         <li>الاحترافية: فريق متخصص لضمان أفضل النتائج.</li>
  //         <li>النتائج الملموسة: تحقيق أهداف قابلة للقياس.</li>
  //         <li>التعاون: شراكة قوية لتحقيق رؤية علامتك التجارية.</li>
  //       </ul>

  //       <h3>نحو مستقبل مشرق مع YFS</h3>
  //       <p>نحن في YFS نسعى دائمًا لتقديم حلول متميزة تسهم في تطوير أعمالك...</p>

  //       <p><strong>اتصل بنا اليوم، وابدأ رحلتك نحو التميز.</strong></p>
  //     `
  // },
  //   {
  //   'id':'2',
  //     'title': 'من بنها لفيجاس: الطريق إلى مستر أولمبيا | القصة التي لم تُروَ من قبل لبطل IFBB Pro أحمد شكري',
  //     'author': 'YFS Marketing Team',
  //     'date': 'April 15, 2025',
  //   'image': '../../assets/news/ahmed-shokrey.jfif',
  //   content: `
  //   <p><strong>كشركة إنتاج وتسويق إعلامي Your First Solution – Marketing & Media Production Agency،</strong> كان لنا الشرف بتوثيق واحدة من أعظم الرحلات الرياضية في تاريخ كمال الأجسام المصري. نحن لا نصنع المحتوى فقط، بل نصنع التاريخ، ونروي القصص التي تلهم الأجيال القادمة.</p>

  //   <h3>رحلة الإنجاز العالمي</h3>
  //   <p>من بنها، المدينة اللي شكلت بداياته، إلى أكبر حدث رياضي في العالم، مستر أولمبيا، وصول شكري لهذا المستوى لم يكن مجرد صدفة. بل كان نتاج سنوات من العرق والتضحية، حتى حقق إنجاز غير مسبوق بحصوله على كارت الاحتراف من IFBB Pro، ليصبح أصغر لاعب مصري محترف، ويسجل رقم قياسي عالمي في موسوعة جينيس للأرقام القياسية.</p>

  //   <h3>صناعة القصة من خلال عدسات YFS</h3>
  //   <p>نحن في Your First Solution لا نصور فقط... نحن نصنع القصص ونحفر الذكريات في عقول الجمهور. من خلال عدساتنا، وثقنا كل لحظة في رحلة أحمد شكري، من التعب والألم، إلى لحظة الوقوف على أكبر مسرح في العالم.</p>

  //   <p>قصص النجاح تحتاج إلى من يحكيها، ونحن في YFS نؤمن بأن كل قصة تستحق أن تروى بشكل يُلهم الأجيال القادمة. إذا كنت تبحث عن من يحول حلمك إلى قصة مرئية تصل للعالم كله، نحن هنا لتحقيق ذلك.</p>

  //   <h3>الرسالة وراء الفيلم</h3>
  //   <p><strong>"من بنها لفيجاس"</strong> مش مجرد فيلم وثائقي عن كمال الأجسام، دي قصة عن الحلم المصري اللي كسر كل الحدود. قصة عن الإصرار، عن التحدي، وعن العقلية اللي بتوصل الإنسان لأعلى مستوى عالمي.</p>

  //   <h3>شكر خاص</h3>
  //   <p>شكر خاص لأهل بنها اللي كانوا دايمًا داعمين لأحمد شكري، ولكل شخص كان جزء من رحلته، وأخيرًا للبطل اللي ألهمنا جميعًا.</p>

  //   <h3>الفيلم متاح الآن حصريًا على يوتيوب</h3>
  //   <p>
  //     <strong>IFBB Pro Ahmed Shokry From Banha to Olympia - أحمد شكري من بنها إلى أولمبيا | (فيلم وثائقي)</strong><br>
  //     <a href="https://youtube.com" target="_blank">شاهد على يوتيوب</a>
  //   </p>

  //   <h4>تابع رحلة أحمد شكري:</h4>
  //   <ul>
  //     <li>انستجرام: <a href="https://instagram.com/AhmedShokry-ifbbpro1" target="_blank">@AhmedShokry-ifbbpro1</a></li>
  //     <li>موقعنا: <a href="https://yourfirstsolution.com" target="_blank">yourfirstsolution.com</a></li>
  //   </ul>

  //   <blockquote><em>هل تريد قصتك تُروى بنفس القوة؟</em></blockquote>
  //   <p>إذا كنت تمتلك قصة تستحق أن تُروى وتريد أن تبرز وسط المنافسين، فنحن في Your First Solution مستعدون لتحويل قصتك إلى محتوى بصري استثنائي.</p>

  //   <p><strong>"If you want to stand out from the crowd... YFS is your solution"</strong></p>

  //   <p>#AhmedShokry #MrOlympia #IFBBPro #GuinnessWorldRecord #YFS_Production #FromBanhaToVegas #Yourfirstsolution</p>
  // `
  //   },
  //   {
  //     'id':'3',
  //     'title': 'Strategic Partnership with IFBB Pro Mohamed Embaby: Elevating Fitness Branding in Egypt',
  //     'author': 'YFS Marketing Team',
  //     'date': 'April 15, 2025',
  //     'image': '../../assets/news/embaby-gym.jfif',
  //     'content':  `
  //     <p><strong>شراكة استراتيجية مع بطل IFBB المحترف محمد إمبابي: رفع مستوى العلامة التجارية للياقة البدنية في مصر</strong></p>
  
  //     <p>في خطوة استراتيجية جديدة، يسر “YFS” (Your First Solution) الإعلان عن شراكتها مع بطل IFBB المحترف محمد إمبابي في مشروعه الجديد الذي سيغير مفهوم اللياقة البدنية في مصر. من خلال هذه الشراكة، نهدف إلى تقديم تجربة فريدة للمجتمع المصري تجمع بين اللياقة البدنية والابتكار في عالم التسويق والإعلام.</p>
  
  //     <h3>محمد إمبابي: شخصية رياضية مبدعة</h3>
  //     <p>محمد إمبابي هو بطل IFBB المحترف الذي لا يحتاج إلى مقدمة. بفضل خبرته الواسعة في مجال كمال الأجسام، ورؤيته الثاقبة، أصبح مصدر إلهام للعديد من الرياضيين حول العالم...</p>
  
  //     <h3>دور “YFS” في هذه الشراكة:</h3>
  //     <p>في “YFS”، نحن نؤمن بأن التسويق ليس مجرد ترويج للمنتجات أو الخدمات، بل هو عملية بناء علامة تجارية مبدعة وقوية تتمحور حول القيم والرسالة...</p>
  
  //     <h3>خدماتنا في هذه الشراكة:</h3>
  //     <ul>
  //       <li><strong>التسويق الرقمي والإعلامي:</strong> تنفيذ حملات مبتكرة عبر الوسائط الاجتماعية مع محتوى مؤثر.</li>
  //       <li><strong>الإبداع في بناء الهوية البصرية:</strong> تصميم شعار وتصميمات تعكس احترافية الجيم الجديد.</li>
  //       <li><strong>إنتاج الفيديو والإعلانات:</strong> فيديوهات ترويجية، موشن جرافيك، ومحتوى بصري فريد.</li>
  //       <li><strong>استراتيجيات التسويق عبر المؤثرين:</strong> التعاون مع مؤثرين في مجال الصحة واللياقة.</li>
  //     </ul>
  
  //     <h3>لماذا تختار “YFS” في هذا المشروع؟</h3>
  //     <ul>
  //       <li>الابتكار والإبداع</li>
  //       <li>الاحترافية</li>
  //       <li>النتائج القابلة للقياس</li>
  //       <li>التفاعل مع الجمهور</li>
  //     </ul>
  
  //     <p><strong>نحو مستقبل مشرق مع محمد إمبابي:</strong> نحن في “YFS” متحمسون لتحقيق رؤية إمبابي وتقديم تجربة رياضية استثنائية تنبض بالحيوية والابتكار.</p>
  
  //     <p><em>اتصل بنا اليوم، وكن جزءًا من هذه الرحلة الرياضية المتميزة!</em></p>
  //   `
  //   }
  //   ,
  //   {
  //     'id':'4',
  //     'title': 'ماكسجين للمكملات الغذائية: تحويل علامة محلية إلى علامة تجارية عالمية بالإبداع والتصميمات المبتكرة',
  //     'author': 'YFS Marketing Team',
  //     'date': 'April 15, 2025',
  //     'image': '../../assets/news/eslam-syaha.jfif',
  //     'content': `
  //     <p>في عالم سريع التغير، يعتبر الابتكار والإبداع عنصرين أساسيين لتحويل أي علامة تجارية من مجرد منتج محلي إلى اسم عالمي يُحتذى به. هذا هو بالضبط ما نجحت “YFS” (Your First Solution) في تحقيقه من خلال شراكتها الاستراتيجية مع “ماكسجين للمكملات الغذائية”. معًا، نعمل على تحويل “ماكسجين” من علامة تجارية محلية إلى علامة تجارية عالمية رائدة في سوق المكملات الغذائية.</p>
  
  //     <h3>ما هو سر النجاح؟</h3>
  //     <p>في “YFS”، نؤمن بقوة أن أي علامة تجارية تمتلك إمكانية النمو والتوسع إذا تم توجيهها عبر الاستراتيجيات الصحيحة. لكن ما يميزنا هو أننا لا نقتصر على تحسين الأداء التسويقي فقط؛ بل نحن نعمل على تحويل كل تفاصيل العلامة التجارية لتصبح أكثر جاذبية، إبداعًا، ومُلهمة.</p>
  //     <p>في حالة “ماكسجين”، كانت البداية قوية، مع منتجات ذات جودة عالية وسلسلة واسعة من المكملات الغذائية التي تحظى بشعبية كبيرة في السوق المحلي. ولكن، كانت هناك حاجة لتوسيع الرؤية وتحقيق طموحات أكبر. لذا، جاء دورنا في “YFS” لتقديم استراتيجية شاملة تهدف إلى تحويل هذه العلامة المحلية إلى علامة تجارية عالمية قادرة على المنافسة في أسواق متعددة.</p>
  
  //     <h3>كيف فعلنا ذلك؟</h3>
  //     <ol>
  //       <li><strong>إعادة بناء الهوية البصرية:</strong>
  //         <p>قمنا بتطوير شعار جديد يتناسب مع رؤية العلامة التجارية العالمية، مع استخدام ألوان وتفاصيل متناسقة تعكس القوة والطاقة التي تمثلها منتجات المكملات الغذائية. هذا التغيير شمل أيضًا تصميم كافة المواد الترويجية.</p>
  //       </li>
  //       <li><strong>تصميم عبوات مبتكرة:</strong>
  //         <p>تأكدنا من أن كل منتج من منتجات “ماكسجين” يُعبأ بطريقة مبتكرة تعكس الاحترافية والجودة. تصميماتنا جمعت بين الجمال والوظيفة لتناسب الأسواق العالمية.</p>
  //       </li>
  //       <li><strong>استراتيجيات تسويقية مبتكرة:</strong>
  //         <p>أطلقنا حملات إبداعية على منصات مثل إنستغرام وفيسبوك، وفعّلنا التسويق عبر المؤثرين العالميين لزيادة الانتشار.</p>
  //       </li>
  //       <li><strong>إنتاج محتوى مرئي إبداعي:</strong>
  //         <p>أنتجنا فيديوهات وموشن جرافيك تبرز جودة منتجات “ماكسجين” وتعزز التواصل مع الجمهور العالمي بأسلوب مميز.</p>
  //       </li>
  //       <li><strong>التوسع على منصات عالمية:</strong>
  //         <p>أطلقنا “ماكسجين” على منصات مثل أمازون، مما أتاح لها الوصول إلى جمهور أوسع وزيادة الطلب من أسواق مختلفة.</p>
  //       </li>
  //     </ol>
  
  //     <h3>نتائج هذه الشراكة:</h3>
  //     <p>استطعنا خلق هوية عالمية لماكسجين من خلال التصميمات الإبداعية والاستراتيجيات التسويقية التي زادت من شهرة العلامة في أسواق جديدة. واليوم، تنمو قاعدة عملائها على المستوى الدولي وتُعرف بجودتها وابتكارها.</p>
  
  //     <h3>العلامة التجارية المحلية تصبح عالمية:</h3>
  //     <p>من خلال هذه الشراكة الاستراتيجية، أثبتنا أن التحول لا يعتمد فقط على المنتج، بل على تقديم تجربة متكاملة من الإبداع والابتكار والتصميم. نحن في YFS نقدم الحلول التسويقية التي تحقق النجاح وتحول العلامات التجارية إلى أسماء عالمية.</p>
  
  //     <p><strong>ابدأ رحلتك مع “ماكسجين” اليوم، وكن جزءًا من هذا التحول العالمي.</strong></p>
  //   `
  //   }
  ];
  
}
